content/essays/28-27-Khost-2002.org
#+TITLE: Khost 2002
#+DATE: 2002-01-01
#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: stories
#+HUGO_TAGS: Civilians
#+EXPORT_FILE_NAME: 28-27-Khost-2002.org
#+LOCATION: Afghanistan
#+YEAR: 2002


In 2002, U.S. forces bombed Khost as part of a wider campaign to dismantle Taliban and al-Qaeda hideouts along the Pakistan border.

Zakir Ahmad, a school principal, was attending evening prayers when a bomb struck a compound believed to house militants nearby. The explosion blew out the mosque’s windows and injured three worshippers.

Zakir later led efforts to rebuild the school, which was damaged in the blast. Many in Khost expressed confusion and anger over the lack of distinction between militant and civilian sites during the raids.

**Source:** [[https://www.amnesty.org/en/wp-content/uploads/2021/06/asa110182002en.pdf][Amnesty International]]
