public/essays/28-27-khost-2002/index.html
<!DOCTYPE html>
<html lang="en-us" data-theme="light">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>05 Baghdad 2003 - Against The Tide</title>
    
    
    <meta name="description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta name="keywords" content="journalism, civilian, military, bombardment, essays, history">
    <meta name="author" content="TorchScribe">
    
    
    <meta property="og:type" content="article">
    <meta property="og:title" content="05 Baghdad 2003 - Against The Tide">
    <meta property="og:description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta property="og:url" content="https://torchscribe.com/essays/28-27-khost-2002/">
    
    
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&family=JetBrains+Mono:wght@400;700&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="/css/style.css">
    
    
    <link rel="icon" type="image/svg+xml" href="/img/favicon.svg">
    <link rel="icon" type="image/png" href="/img/favicon.png">
    
    
</head>
<body>
    <div class="container">
        <header>
    <div class="logo">Against <span>The</span> Tide</div>
    <nav>
        
        
        <a href="/" >Home</a>
        
        <a href="/#essays" >Essays</a>
        
        <a href="/about/" >About</a>
        
        <button id="theme-toggle" aria-label="Toggle dark mode">
            <span class="theme-toggle-icon">◐</span>
        </button>
    </nav>
</header>

        <main>
            
<article class="essay-content markdown-content">
    <header class="essay-header">
        <h1>05 Baghdad 2003</h1>
        <div class="metadata">
            <p><strong>Location:</strong> </p>
            <p><strong>Year:</strong> </p>
        </div>
    </header>
    
    <div class="essay-article">
        
<p>
In 2002, U.S. forces bombed Khost as part of a wider campaign to dismantle Taliban and al-Qaeda hideouts along the Pakistan border.</p>
<p>
Zakir Ahmad, a school principal, was attending evening prayers when a bomb struck a compound believed to house militants nearby. The explosion blew out the mosque’s windows and injured three worshippers.</p>
<p>
Zakir later led efforts to rebuild the school, which was damaged in the blast. Many in Khost expressed confusion and anger over the lack of distinction between militant and civilian sites during the raids.</p>
<p>
<strong><strong>Source:</strong></strong> [Amnesty International](<a href="https://www.amnesty.org/en/wp-content/uploads/2021/06/asa110182002en.pdf)">https://www.amnesty.org/en/wp-content/uploads/2021/06/asa110182002en.pdf)</a></p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Sources
</h2>
</div>

    </div>
    
    
    
    <div class="essay-navigation">
        <a href="/#essays" class="back-to-essays">← Back to Essays</a>
    </div>
</article>

        </main>

        <footer>
    <p>© 2025 Against The Tide · All rights reserved</p>
    <p>Curated by TorchScribe</p>
</footer>
    </div>

    <script>
    
    document.addEventListener('DOMContentLoaded', () => {
        const themeToggle = document.getElementById('theme-toggle');
        
        themeToggle.addEventListener('click', () => {
            const currentTheme = document.documentElement.getAttribute('data-theme');
            const newTheme = currentTheme === 'dark' ? 'light' : 'dark';
            
            setTheme(newTheme);
        });
    });
    
    
    document.addEventListener('keydown', (e) => {
        
        if (e.altKey && e.key === 's') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'Home') {
            e.preventDefault();
            window.location.href = '/';
        }
        
        
        if (e.altKey && e.key === 'e') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'a') {
            e.preventDefault();
            window.location.href = '/about/';
        }
    });
</script>
</body>
</html>